Repository: llybin/TelegramExchangeRatesBot
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fr, uz

source: Data is provided by financial exchanges and may be delayed as specified by financial exchanges or our data providers. Bot does not verify any data and disclaims any obligation to do so. Bot cannot guarantee the accuracy of the exchange rates displayed. You should confirm current rates before making any transactions that could be affected by changes in the exchange rates.
fr: Les données sont fournies par des échanges financiers et peuvent être retardées comme spécifié par les échanges financiers ou nos fournisseurs de données. Le Bot ne vérifie aucune donnée et décline toute obligation de le faire. Le Bot ne peut pas garantir l’exactitude des taux de change affichés. Vous devez confirmer les taux courants avant d’effectuer toute transaction qui pourrait être affectée par les changements des taux de change.
uz: Ma'lumotlar moliyaviy ayrboshlash tomonidan taqdim etiladi va moliyaviy ayriboshlash yoki malumot provayderlari sababli kechikishi mumkin. Bot hech qanday ma'lumotni tasdiqlamaydi va bunday qilish majburiyatidan voz kechadi. Asosiy ko'rsatilgan valyuta kurslarining to'g'riligini kafolatlamaydi. Ayirboshlash kursi o'zgarishidan ta'sirlanishi mumkin bo'lgan operatsiyalarni amalga oshirishdan oldin joriy kurslarni tasdiqlashingiz kerak.

source: The command is not available for group chats
fr: La commande n’est pas disponible pour les discussions de groupe
uz: Bu buyruq guruhlarda mavjud emas.

source: What do you want to tell? Or nothing?
fr: Que voulez-vous dire ? ou rien ?
uz: Nimani aytib berishni yoki aytib bermaslikni xohlaysiz?

source: Message sent, thank you.
fr: Le message a envoyé, merci.
uz: Xabar yuborildi. rahmat.

source: *Commands*
fr: *Commandes*
uz: *Buyruqlar*

source: /start - Start to enslave mankind
fr: /start - Le début pour asservir l'humanité
uz: /start - Hayotingizni osonlashtiring

source: /tutorial - Tutorial, how to talk with me
fr: /tutorial - Tutoriel, comment parler avec moi
uz: /tutorial - Men bilan qanday gaplashish haqida qo'llanma

source: /currencies - All currencies that I support
fr: /currencies - Toutes les monnaies que je supporte(soutiens)
uz: /currencies - Men qo'llab quvvatlaydigan barcha pul birliklari

source: /feedback - If you have suggestions, text me
fr: /feedback - Si vous avez des suggestions, écrivez-moi
uz: /feedback - Agar takliflaringiz bor bo'lsa, menga yuboring

source: /keyboard - Hide / show a keyboard with request history
fr: /keyboard - Masquer / montrer un clavier avec l’historique des requêtes

source: /p - Command for group chats, get exchange rate
fr: /p - Commande pour les discussions de groupe, obtenir le taux de change
uz: /p - Guruhlarlarda kursni bilish uchun buyruq

source: /sources - Currency rates sources
fr: /sources - sources de Cours des devises
uz: /sources - Pul birlik kurslarining manbalari

source: /settings - Bot personal settings
fr: /settings - réglages personnels du bot
uz: /settings - Bot sozlamalari

source: /disclaimers - Disclaimers
fr: /disclaimers - Avertissements
uz: /disclaimers - Ogohlantirishlar

source: /stop - Unsubscribe
fr: /stop - vous désabonner
uz: /stop - Obunalikdan chiqish

source: Don't have your localization? Any translation errors? Help fix it 👉 [poeditor.com](%(trans_link)s)
fr: Vous n’avez pas votre langue? Des erreurs de traduction? Aidez-le à corriger 👉 [poeditor.com](%(trans_link)s)
uz: Sizning til mavjud emasmi? Biror yer tarjimasida xato bormi? Uni tuzatishda yordam bering 👉 [poeditor.com](%(trans_link)s)

source: Keyboard is shown.
fr: Le clavier est montré.

source: Keyboard is hidden.
fr: Le clavier est caché.

source: What do you want to set up?
fr: Que voulez-vous mettre en place?
uz: Nimani sozlashni xohlaysiz?

source: *%(language)s* is your language now.
fr: *%(language)s* est votre langue maintenant.
uz: Hozirda *%(language)s* sizning tilingiz.

source: If you'd like to change send me new or /back
fr: Si vous souhaitez changer envoyez-moi une nouvelle ou /back

source: *%(default_currency)s* is your default currency.
fr: *%(default_currency)s* est votre devise par défaut.
uz: *%(default_currency)s* sizning standart pul birligingiz.

source: *%(position)s* - position where your default currency will be added.
fr: *%(position)s* - position à laquelle votre devise par défaut sera ajoutée.
uz: *%(position)s* - sizning standart pul birligingiz joylashish pozitsiyasi

source: The message must contain currencies or amounts 👉 /tutorial
fr: Le message doit contenir des devises ou des montants 👉 /tutorial
uz: Xabarda pul birligi yoki miqdorlari kiritilishi shart 👉 /tutorial

source: I don't understand you 😞 Take a look here 👉 /help
fr: Je ne comprends pas 😞 Jetez un coup d'oeil ici 👉 /help
uz: Sizni tushunmayapman 😞 buyerga bir qarang 👉 /help

source: I understood that you asked, but at the moment I don't have actual exchange rates for your request. Try later. Sorry. 😭
fr: Je comprends ce que vous me demandez, mais pour le moment, je n’ai pas de taux de change pour votre demande. Essayez plus tard. Désolé. 😭
uz: So'rovingizni tushundim, Lekin ayni paytda Menda sizning so'rovingiz bo'yicha ayirboshlash kursi mavjud emas. Keyinroq urunib ko'ring. Kechirasiz. 😭

source: humans
fr: humains
uz: Insonlar

source: Hello, %(name)s!
fr: Salut, %(name)s!
uz: Salom, %(name)s!

source: Have any question how to talk with me? 👉 /tutorial
fr: Avez-vous une question, vous souhaitez parler avec moi? 👉 /tutorial
uz: Men bilan qanday gaplashish haqida bilmoqchimisiz? 👉 /tutorial

source: You're unsubscribed. You always can subscribe again 👉 /start
fr: Vous êtes désabonné. Vous pouvez toujours vous abonner à nouveau en faisant 👉 /start
uz: Obunalikdan chiqdingiz. /Har doim takror obuna bo'lishingiz mumkin 👉 /start

source: I am bot. I will help you to know a current exchange rates.
fr: Je suis un robot. Je vais vous aider à connaître les taux de change actuels.
uz: Men botman. Sizga joriy valyuta kurslarini bilish uchun yordam beraman.

source: Send me a message like this: *BTC USD* - to see the current exchange rate for pair *100 USD EUR* - to convert the amount from 100 USD to EUR
fr: Envoyez-moi un message formaté comme celui-ci: *BTC USD* - pour voir le taux de change actuel pour la paire *100 USD EUR* - pour convertir le montant de 100 USD en EUR
uz: Menga mana bunday xabarlar jo'nating: Joriy valyuta kursini bilish uchun - *BTC USD* 100 dollar yevroda qancha ekanligini bilish uchun - *100 USD EUR*

source: Just text me message in private chat.
fr: Envoyez-moi simplement un message en chat privé.
uz: Menga shaxsiy xabar yuboring.

source: In group chats use commands like this: 👉 /p USD EUR 👈 or simply /USDEUR
fr: Dans les discussions de groupe, utilisez les commandes suivantes: 👉 /p USD EUR 👈 ou simplement /USDEUR
uz: Guruhlarda ushbu buyruqlardan foydalaning: 👉 /p USD EUR 👈 yoki oddiygina /USDEUR

source: Inline mode is available. See how to use [here](%(link)s).
fr: Le mode inline est disponible. Voir comment l'utiliser [ici](%(link)s).
uz: Inline rejim ham mavjud. Qanday foydalanishni [bu yer](%(link)s) dan bilib oling.

source: Also take a look here 👉 /help
fr: Vous pouvez regardez aussi ici 👉 /help
uz: Va buyerga ham qarab qo'ying 👉 /help

source: Language
uz: Til

source: Default currency
uz: Standart pul birligi

source: Default currency position
uz: Standart pul birligi joylashuvi
